#include <iostream>
// 모양이 회전, 대칭가능 함을 고려
// 모든 좌표에 대해 19가지 도형의 최대합을 모두 구해 최대값을 구함
// block 정의 시 왼쪽상단 기준으로 좌표정의

using namespace std;

int arr[500][500];
int block[19][3][2] = { //19가지 모양 경우의수 * i,j 외 블럭3개 * col,low
    {{0,1},{0,2},{0,3}},////ㅡ**
    {{1,0},{2,0},{3,0}},////ㅣ**
    {{0,1},{1,0},{1,1}},//ㅁ**
    {{0,1},{0,2},{1,2}},//ㄱ**
    {{0,1},{0,2},{1,0}},//**
    {{1,0},{2,0},{2,-1}},//**
    {{1,0},{2,0},{2,1}},//**
    {{1,0},{1,1},{1,2}},//**
    {{0,1},{0,2},{-1,2}},//**
    {{1,0},{2,0},{0,1}},//**
    {{0,1},{1,1},{2,1}},//**
    {{1,0},{1,-1},{2,-1}},//**
    {{1,0},{1,1},{2,1}},//**
    {{0,1},{1,1},{1,2}},//**//{{0,1},{1,1},{2,1}}, //실수
    {{0,1},{-1,1},{-1,2}},  //{{0,1},{1,0},{1,-1}},//왼쪽상단을 기준으로 잡지않아서 문제?
    {{0,1},{0,2},{1,1}},//**
    {{0,1},{0,2},{-1,1}},//**
    {{1,0},{2,0},{1,-1}},//**
    {{1,0},{2,0},{1,1}}//**
};

int main(int argc, const char * argv[]) {
    int n, m;
    cin>>n>>m;

    for(int i = 0; i < n; ++i) {
        for(int j = 0; j < m; ++j) {
            int temp;
            cin >> temp;
            arr[i][j] = temp;
        }
    }
    int ans = 0;
    for(int i = 0; i < n; ++i) {
        for(int j = 0; j < m; ++j) {
            for(int k = 0; k < 19; ++k) {
                bool ok = true;
                int sum = arr[i][j];
                for(int l = 0; l < 3; ++l) {
                    int x = i+block[k][l][0];
                    int y = j+block[k][l][1];
                    if(0 <= x && x < n && 0 <= y && y < m) {
                        sum += arr[x][y];
                    } else {
                        ok = false;
                        break;
                    }
                }
                if(ok && ans < sum) {
                    ans = sum;
                }
            }
        }
    }
    
    cout<< ans <<'\n';
    
    return 0;
}
